Revit 2026 API

# ColorOptionsEditingColor Property

---

The color of the current canvas theme used to render elements when editing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color EditingColor { get; set; }
```
```vb
Public Property EditingColor As Color
	Get
	Set
```
```cpp
public:
property Color^ EditingColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member EditingColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ColorOptions Class

Autodesk.Revit.DB Namespace